Enterprise_Serivces/Prod/SilverGroup2/LoyaltyChannel/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/channel/loyalty/contracts/2010/05/LoyaltyService/GetPreferencesQandA</wsa:Action><wsa:MessageID>uuid:0d161cab-ea47-405e-9fdb-fab13618d1a9</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://loyaltychannelqa1.testgs.pvt/LoyaltyService.svc</wsa:To></soap:Header><soap:Body><GetPreferencesQandA xmlns="http://www.gamestop.com/services/channel/loyalty/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><International xsi:nil="true" xmlns="http://www.gamestop.com/services/core/contracts/2010/05" /><Categories xmlns="http://www.gamestop.com/services/channel/loyalty/messages/2010/05"><string xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">abcde</string></Categories><CustomerID xmlns="http://www.gamestop.com/services/channel/loyalty/messages/2010/05">1276939253</CustomerID></request></GetPreferencesQandA></soap:Body></soap:Envelope>